results/gcs_ssd/fio-rw:randrw-rwmixread:66-numjobs:10-iodepth:3-bs:4k.out
fio-rw:randrw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=3
...
fio-3.28
Starting 10 processes
fio-rw:randrw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:randrw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:randrw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)
[...]

fio-rw:randrw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: (groupid=0, jobs=10): err= 0: pid=32984: Mon Feb 26 20:44:32 2024
  read: IOPS=15.2k, BW=59.4MiB/s (62.3MB/s)(17.5GiB/302425msec)
    slat (usec): min=175, max=192261, avg=637.78, stdev=788.72
    clat (usec): min=3, max=192989, avg=864.91, stdev=1018.02
     lat (usec): min=208, max=193399, avg=1503.54, stdev=1380.75
    clat percentiles (usec):
     |  1.00th=[   23],  5.00th=[   29], 10.00th=[   40], 20.00th=[  445],
     | 30.00th=[  506], 40.00th=[  578], 50.00th=[  734], 60.00th=[  881],
     | 70.00th=[  988], 80.00th=[ 1123], 90.00th=[ 1418], 95.00th=[ 2376],
     | 99.00th=[ 3949], 99.50th=[ 4752], 99.90th=[ 5538], 99.95th=[ 6587],
     | 99.99th=[11076]
   bw (  KiB/s): min=21328, max=89634, per=100.00%, avg=61338.50, stdev=2176.07, samples=5990
   iops        : min= 5332, max=22408, avg=15333.62, stdev=543.99, samples=5990
  write: IOPS=7840, BW=30.6MiB/s (32.1MB/s)(9262MiB/302425msec); 0 zone resets
    slat (usec): min=3, max=1195, avg=10.86, stdev= 6.52
    clat (usec): min=3, max=192686, avg=859.75, stdev=1067.53
     lat (usec): min=18, max=192696, avg=870.76, stdev=1067.92
    clat percentiles (usec):
     |  1.00th=[   16],  5.00th=[   18], 10.00th=[   23], 20.00th=[  433],
     | 30.00th=[  494], 40.00th=[  570], 50.00th=[  725], 60.00th=[  873],
     | 70.00th=[  979], 80.00th=[ 1106], 90.00th=[ 1418], 95.00th=[ 2376],
     | 99.00th=[ 4178], 99.50th=[ 4817], 99.90th=[ 5538], 99.95th=[ 6652],
     | 99.99th=[47973]
   bw (  KiB/s): min= 9533, max=49869, per=100.00%, avg=31619.63, stdev=1137.11, samples=5990
   iops        : min= 2382, max=12466, avg=7903.51, stdev=284.31, samples=5990
  lat (usec)   : 4=0.01%, 10=0.01%, 20=2.97%, 50=8.31%, 100=0.26%
  lat (usec)   : 250=0.04%, 500=18.27%, 750=21.13%, 1000=20.53%
  lat (msec)   : 2=22.01%, 4=5.47%, 10=1.00%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.76%, sys=5.58%, ctx=4608212, majf=0, minf=199
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4599616,2371047,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=3

Run status group 0 (all jobs):
   READ: bw=59.4MiB/s (62.3MB/s), 59.4MiB/s-59.4MiB/s (62.3MB/s-62.3MB/s), io=17.5GiB (18.8GB), run=302425-302425msec
  WRITE: bw=30.6MiB/s (32.1MB/s), 30.6MiB/s-30.6MiB/s (32.1MB/s-32.1MB/s), io=9262MiB (9712MB), run=302425-302425msec

Disk stats (read/write):
  sdd: ios=4599616/2271132, merge=0/7, ticks=2717749/3087879, in_queue=5805634, util=100.00%