results/gcs_ssd/fio-rw:rw-rwmixread:33-numjobs:10-iodepth:1-bs:4k.out
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:1-bs:4k: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 10 processes
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:1-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:1-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:1-bs:4k: Laying out IO file (1 file / 4096MiB)
[...]

fio-rw:rw-rwmixread:33-numjobs:10-iodepth:1-bs:4k: (groupid=0, jobs=10): err= 0: pid=29684: Mon Feb 26 15:03:32 2024
  read: IOPS=67.0k, BW=262MiB/s (274MB/s)(81.4GiB/318354msec)
    slat (nsec): min=1460, max=60664k, avg=7286.24, stdev=149398.34
    clat (nsec): min=948, max=1937.2k, avg=1099.10, stdev=1816.38
     lat (usec): min=2, max=60670, avg= 8.47, stdev=149.55
    clat percentiles (nsec):
     |  1.00th=[  964],  5.00th=[  972], 10.00th=[  980], 20.00th=[  988],
     | 30.00th=[  988], 40.00th=[  996], 50.00th=[ 1004], 60.00th=[ 1012],
     | 70.00th=[ 1032], 80.00th=[ 1128], 90.00th=[ 1224], 95.00th=[ 1416],
     | 99.00th=[ 1784], 99.50th=[ 3504], 99.90th=[ 9024], 99.95th=[17536],
     | 99.99th=[36608]
   bw (  KiB/s): min=37561, max=2113680, per=100.00%, avg=329138.56, stdev=23140.11, samples=5181
   iops        : min= 9389, max=528420, avg=82283.77, stdev=5785.03, samples=5181
  write: IOPS=136k, BW=531MiB/s (557MB/s)(165GiB/318354msec); 0 zone resets
    slat (nsec): min=1868, max=185471k, avg=52534.09, stdev=1332271.40
    clat (nsec): min=970, max=2987.0k, avg=1153.77, stdev=1951.40
     lat (usec): min=2, max=185478, avg=53.80, stdev=1332.54
    clat percentiles (nsec):
     |  1.00th=[  996],  5.00th=[ 1012], 10.00th=[ 1020], 20.00th=[ 1032],
     | 30.00th=[ 1032], 40.00th=[ 1048], 50.00th=[ 1048], 60.00th=[ 1064],
     | 70.00th=[ 1096], 80.00th=[ 1160], 90.00th=[ 1288], 95.00th=[ 1496],
     | 99.00th=[ 1832], 99.50th=[ 3472], 99.90th=[ 9408], 99.95th=[18048],
     | 99.99th=[38144]
   bw (  KiB/s): min=79497, max=4277152, per=100.00%, avg=668252.09, stdev=46965.29, samples=5181
   iops        : min=19873, max=1069288, avg=167062.12, stdev=11741.33, samples=5181
  lat (nsec)   : 1000=15.79%
  lat (usec)   : 2=83.53%, 4=0.23%, 10=0.36%, 20=0.05%, 50=0.03%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=4.80%, sys=9.44%, ctx=180520, majf=0, minf=205
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=21331416,43309281,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=262MiB/s (274MB/s), 262MiB/s-262MiB/s (274MB/s-274MB/s), io=81.4GiB (87.4GB), run=318354-318354msec
  WRITE: bw=531MiB/s (557MB/s), 531MiB/s-531MiB/s (557MB/s-557MB/s), io=165GiB (177GB), run=318354-318354msec

Disk stats (read/write):
  sdd: ios=167944/706859, merge=0/68, ticks=335064/8452457, in_queue=8787526, util=99.54%