results/gcs_ssd/fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M.out
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: (g=0): rw=rw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 10 processes
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
[...]

fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: (groupid=0, jobs=10): err= 0: pid=31752: Mon Feb 26 16:59:25 2024
  read: IOPS=629, BW=630MiB/s (660MB/s)(189GiB/307020msec)
    slat (usec): min=101, max=67494, avg=13102.15, stdev=7524.14
    clat (nsec): min=1104, max=337236, avg=4265.52, stdev=2344.17
     lat (usec): min=103, max=67501, avg=13108.03, stdev=7525.91
    clat percentiles (nsec):
     |  1.00th=[ 1224],  5.00th=[ 1336], 10.00th=[ 1496], 20.00th=[ 3536],
     | 30.00th=[ 4192], 40.00th=[ 4384], 50.00th=[ 4512], 60.00th=[ 4640],
     | 70.00th=[ 4832], 80.00th=[ 4960], 90.00th=[ 5280], 95.00th=[ 5600],
     | 99.00th=[10048], 99.50th=[14272], 99.90th=[30848], 99.95th=[37120],
     | 99.99th=[62720]
   bw (  KiB/s): min=51200, max=17891328, per=100.00%, avg=751383.43, stdev=130644.86, samples=5260
   iops        : min=   50, max=17472, avg=733.72, stdev=127.58, samples=5260
  write: IOPS=324, BW=325MiB/s (341MB/s)(97.4GiB/307020msec); 0 zone resets
    slat (usec): min=233, max=30867, avg=467.29, stdev=663.43
    clat (nsec): min=1244, max=1151.1k, avg=2452.03, stdev=3930.81
     lat (usec): min=235, max=30873, avg=470.39, stdev=663.65
    clat percentiles (nsec):
     |  1.00th=[ 1432],  5.00th=[ 1608], 10.00th=[ 1720], 20.00th=[ 1880],
     | 30.00th=[ 2008], 40.00th=[ 2128], 50.00th=[ 2256], 60.00th=[ 2384],
     | 70.00th=[ 2544], 80.00th=[ 2768], 90.00th=[ 3120], 95.00th=[ 3504],
     | 99.00th=[ 5088], 99.50th=[ 8896], 99.90th=[24448], 99.95th=[30848],
     | 99.99th=[48384]
   bw (  KiB/s): min=32768, max=9179136, per=100.00%, avg=387724.60, stdev=67698.73, samples=5258
   iops        : min=   32, max= 8964, avg=378.61, stdev=66.11, samples=5258
  lat (usec)   : 2=20.76%, 4=29.38%, 10=49.06%, 20=0.57%, 50=0.22%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=0.82%, sys=5.39%, ctx=599503, majf=0, minf=183
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=193319,99711,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=630MiB/s (660MB/s), 630MiB/s-630MiB/s (660MB/s-660MB/s), io=189GiB (203GB), run=307020-307020msec
  WRITE: bw=325MiB/s (341MB/s), 325MiB/s-325MiB/s (341MB/s-341MB/s), io=97.4GiB (105GB), run=307020-307020msec

Disk stats (read/write):
  sdd: ios=630502/411437, merge=0/30, ticks=4964717/4724677, in_queue=9689399, util=100.00%